OpenPuya/PY32T020_Firmware/Drivers/PY32T020_HAL_Driver/Src/py32t020_hal_comp.c
  /* Return HAL COMP handle state */
  return hcomp->State;
}

/**
  * @brief  Return the COMP error code.
  * @param hcomp COMP handle
  * @retval COMP error code
  */
uint32_t HAL_COMP_GetError(COMP_HandleTypeDef *hcomp)
{
  /* Check the parameters */
  assert_param(IS_COMP_ALL_INSTANCE(hcomp->Instance));

  return hcomp->ErrorCode;
}

/**
  * @}
  */


/* Private functions ---------------------------------------------------------*/

/** @addtogroup COMP_Private_Functions
  * @{
  */


/**
  * @brief  Check if need to configure the Vrefcmp
  * @param  hcomp  COMP handle
  * @retval 0 or 1
  */
static uint32_t COMP_VrefcmpCheck(COMP_HandleTypeDef *hcomp)   
{
  return (((hcomp->Instance == COMP1) && (hcomp->Init.InputPlus == COMP_INPUT_PLUS_IO3)) 
    || ((hcomp->Instance == COMP2) && (hcomp->Init.InputPlus == COMP_INPUT_PLUS_IO4)));

}

/**
  * @brief  Configure the Vrefint or Vrefbuf or Vrefcmp 
  * @param  hcomp  COMP handle
  * @retval None
  */
static HAL_StatusTypeDef COMP_VrefConfig(COMP_HandleTypeDef *hcomp)   
{ 
  HAL_StatusTypeDef status = HAL_OK;
  if(COMP_VrefcmpCheck(hcomp))
  {
    /* Voltage divider */  
    FlagStatus adcclkchanged = RESET;


    FlagStatus comp1clkchanged = RESET;
    
    if(hcomp->Instance == COMP2)   
    {
      if (__HAL_RCC_COMP1_IS_CLK_DISABLED() != 0U)
      {
        __HAL_RCC_COMP1_CLK_ENABLE();
        comp1clkchanged = SET;
      }
    }

    if(hcomp->Init.VrefSrc == COMP_VREFCMP_SOURCE_VCC)
    {
      SET_BIT(COMP1->CSR,COMP_CSR_COMP_VCSEL);
    }
    else
    {
      if (__HAL_RCC_ADC_IS_CLK_DISABLED() != 0U)
      {
        __HAL_RCC_ADC_CLK_ENABLE();
        adcclkchanged = SET;
      }
      
      MODIFY_REG(ADC->CCR, ADC_CCR_VREFBUF_EN | ADC_CCR_VREFBUF_SEL, (hcomp->Init.VrefSrc));
      /* Restore clock configuration if changed */
      if (adcclkchanged == SET)
      {
        __HAL_RCC_ADC_CLK_DISABLE();
      }
      
      CLEAR_BIT(COMP1->CSR,COMP_CSR_COMP_VCSEL);   
    }   

    MODIFY_REG(COMP1->CSR, COMP_CSR_COMP_VCDIV | COMP_CSR_COMP_VCDIV_EN, hcomp->Init.VrefDiv);    
    
    if(hcomp->Instance == COMP2)
    {      
      /* Restore clock configuration if changed */
      if (comp1clkchanged == SET)
      {
        __HAL_RCC_COMP1_CLK_DISABLE();
      }
    }
  }
  else
  {
  }
  
  return status;
}  

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */



#endif /* HAL_COMP_MODULE_ENABLED */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
